##################################################################################
################################################################################## 
# Task:
#             1.环内 （环上某node --> 环外某node --> 环上某node）
# 			      2.出环 （环上某node --> 环外某node ）
# 			      3.进环 （环外某node --> 环上某node ）
#
#
#     往后走一步的Reaction     #这些Reaction是否也在别的环里 1在 0不在
#
##################################################################################

#########################################################################
# 3.统计(按流方向统计)
# 全部环中 up行的cin&cout化合物 的deg_in deg_out的化合物出现频率
# 全部环中 gap行的cin&cout化合物 的deg_in deg_out的化合物出现频率
#
# od<---c_out<---c_in<---ind
# od<---c_out<---c_in<---ind
#########################################################################

#########################################################################
# 4.统计(按流方向统计)
# ug环中 up行的cin&cout化合物 的deg_in deg_out的化合物出现频率
# ug环中 gap行的cin&cout化合物 的deg_in deg_out的化合物出现频率
#
# od<---c_out<---c_in<---ind
# od<---c_out<---c_in<---ind
#########################################################################

# 5.在suc1_code中做 metric 统计 od 和 ind 的化合物频率(gap化合物频率 up化合物频率)
# 在suc1_code中建立新的文件夹



